[
    {
        "id": 13,
        "created_at": "2024-05-16T18:25:06.851465+00:00",
        "name": "Sylph",
        "rarity": "UNCOMMON",
        "description": "> _Sylphs are an intense and lively people, flighty and tempestuous. These planar scions have kinship to beings of elemental air such as jaathooms, phades, and cloud dragons._\n\nSylphs enjoying following their own tempos, shifting between wild energy that draws all eyes to embodying the spirit of unseen breezes that slip away without note. They often build their identities around their perceived personal connection to the element of air, relating to a gentle breeze, a sudden flash of lightning, or an uncontrollable storm.\n\nSome sylphs are born with a connection to an extremely focused aspect of elemental air, such as smoke, storms, or toxic gas. While it does happen, a child is rarely born with a lineage that differs from their parents’, as geniekin typically pass these unusual gifts on to their offspring. Lineages can manifest in sylph children as a result of where they’re born, such as when stormsoul sylphs are birthed in regions prone to tornadoes or windstorms. A lineage can also reflect a sylph’s elemental heritage like in smokesoul sylphs, who often descend from belkers. Fumesoul sylphs, on the other hand, are associated with poisonous and otherwise unbreathable gases.",
        "trait_id": 3034,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-sylph-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 18,
        "version": "1.0",
        "heritage_id": 27220,
        "uuid": 6084172367169943,
        "deprecated": null
    },
    {
        "id": 5,
        "created_at": "2024-04-19T01:46:51.216905+00:00",
        "name": "Talos",
        "rarity": "UNCOMMON",
        "description": "> _Taloses, geniekin gifted with magic from the Plane of Metal, resonate with the unlimited potential of raw ore, the treasured shine of polished gold, or the forgiving ring of a hammer reforging a broken blade._\n\nAs the Plane of Metal renews its contact with other planes, its influence over the bloodlines of those descended from its elemental denizens results in an ever-increasing number of the planar scions known as taloses. This isn’t limited to only newborns—it can spring forth in adults with latent connections, fed by the explosion of elemental metal magic cascading across the Universe. Other lineages have lingered in on Golarion since before the elemental plane’s retreat, mistaken for other planar scions such as oreads or aphorites.\n\nSome talos lineages possess an inherent connection to a particular aspect of elemental metal, such as iron-based ferrous metals, lustrous precious metals, or the rare liquid metals such as mercury or djezet. Often, but not always, these taloses share their lineage with their parents. Taloses can most often be found among alchemists, smiths, inventors, and miners—anyone who works with metal for a living.",
        "trait_id": 2549,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-talos-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 15,
        "version": "1.0",
        "heritage_id": 21716,
        "uuid": 7564423746785655,
        "deprecated": null
    },
    {
        "id": 15,
        "created_at": "2024-05-19T18:08:32.894695+00:00",
        "name": "Ardande",
        "rarity": "UNCOMMON",
        "description": "> _The strength of a baobab trunk and flexibility of a yew branch, flowers and fruit sprinkled across a forest canopy like jewels in a crown, soft moss blankets, and the daytime constellations created by pinpricks of light through leaves—this is what ardandes are made of._\n\nArdandes are geniekin, or elemental planar scions, born with elemental wood for flesh and blood-like sap flowing through their veins; just as much elemental essence as they are mortal. They are the descendants of wood elementals, kizidhars, dryads, and forest dragons, or were born under the influence of powerful elemental forces tied to the First World or Plane of Wood.\n\nArdandes often share a connection to specific aspects of wood, such as spring blossoms, ancient and rotten stumps seething with life that feeds on their decay, or sap dripping down tree bark; this is called an ardande lineage. Typically, an ardande has the same lineage as their ardande parent, though some are born with a new or different lineage, or to parents who didn’t have one. Sometimes a lineage reflects where an ardande was born, such as springsoul ardandes born in the vibrant, portal-riddled Grungir Forest in the Lands of the Linnorm Kings, or moldersoul ardandes influenced by the Darkblight infection of the Southern Fangwood. They can also occur as a reflection of the ardande’s planar ancestry, like ambersoul ardandes who descend from kizidhars.\n\nIf you want to play a character who embodies the tenacity, flexibility, and succor of elemental wood, you should play an ardande.",
        "trait_id": 2546,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-ardande-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 15,
        "version": "1.0",
        "heritage_id": 27415,
        "uuid": 7236486666846145,
        "deprecated": null
    },
    {
        "id": 14,
        "created_at": "2024-05-19T18:05:22.519843+00:00",
        "name": "Aphorite",
        "rarity": "UNCOMMON",
        "description": "> _Once perfectly identical beings who bridged the gap between Axis’s perfect order and mortals’ unrestricted existence, aphorites are now lit more by the spark of free will than the beacon of cosmic law._\n\nAphorites were first forged by axiomites, the primary inhabitants of the Eternal City of Axis, the plane of pure law. The original aphorites served as liaisons between their lawful progenitors and frustratingly unpredictable mortal allies. Marrying the logical thought processes of conformity to law and the gift of self-determination, early aphorites spread across the Material Plane to serve as Axis’s proxies and enact its will. Over time, their appearances and personalities grew to resemble their mortal comrades as they were increasingly born among mortals. Aphorites still exhibit Axis’s touch in their metallic skin coated in crystalline dust, aptitude for logic, strength in artisanship, and propensity for order and cooperation. But despite these links to their purpose-built origins, contemporary aphorites are undoubtedly their own masters.\n\nIf you want to play a character intrinsically tied to the underlying order of the universe, walking the thin line between calculated predestination and free will, you should play an aphorite.",
        "trait_id": 3036,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-aphorite-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 18,
        "version": "1.0",
        "heritage_id": 27414,
        "uuid": 2689139303265510,
        "deprecated": null
    },
    {
        "id": 17,
        "created_at": "2024-05-20T01:10:07.570036+00:00",
        "name": "Ganzi",
        "rarity": "UNCOMMON",
        "description": "> _Children of chaos, ganzis are born of the roiling effervescence of the untamable Maelstrom, the primal sea of all creation. Their blood crackles with the promise of change and the raw power of creation unshackled._\n\nWhile some ganzis are born of mortals who mingled with the inchoate beings of the Maelstrom, and some are descended from those who sailed that cerulean void, many others are born in places where the Universe frays toward chaos. Whatever their roots, all ganzis share the same potent essence.\n\nMore than any other planar scions, ganzis are prone to appearing in otherwise stolid and unremarkable bloodlines. While this is sometimes cause for scandal in less open-minded communities, most ganzi children grow up as happy and loved as any other child. Ganzi children often exhibit irrepressible energy and good-natured mischief. A few even grow out of these tendencies eventually.\n\nIf you want a character that channels the spontaneous and the unpredictable, that defies categorization while still finding commonality with other nonconformists, you should play a ganzi.",
        "trait_id": 3035,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-ganzi-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 18,
        "version": "1.0",
        "heritage_id": 27417,
        "uuid": 7834125501662308,
        "deprecated": null
    },
    {
        "id": 18,
        "created_at": "2024-05-20T01:12:49.874878+00:00",
        "name": "Oread",
        "rarity": "UNCOMMON",
        "description": "> _The Plane of Earth’s influence runs through an oread’s family, most often from a jabali or crystal dragon ancestor. Oreads tend to be stoic, steadfast, and dependable, but they contain depths not seen on the surface._\n\nOreads can be slow to reveal their true selves, or perhaps more accurately, have enough depth and mystery inherent to their beings that they can reveal new and unexpected facets of themselves every day. They usually feel that they personify certain aspects of earth, stone, or other sediments or minerals, such as a cliff’s tenacious resilience against erosion, the generosity and nourishment of fertile soil, or the versatile utility of metal and stone.\n\nOreads born with a special connection to a specific subset of elemental earth, such as crystal, dust, or mud, might have an oread lineage. A lineage can be inherited along a family bloodline, or it can manifest spontaneously in oread children. They can be caused by where an oread’s ancestors lived, frequently seen in dustsoul oreads, many of whom are born in a desert or to a family that has farmed for generations. Lineages can also be the result of specific planar heritages. Gemsoul oreads often have a crystal dragon in their lineage, and miresoul oreads descend from the more sodden creatures of elemental earth.",
        "trait_id": 3041,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-oread-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 18,
        "version": "1.0",
        "heritage_id": 27418,
        "uuid": 702783896221437,
        "deprecated": null
    },
    {
        "id": 19,
        "created_at": "2024-05-20T01:16:22.734418+00:00",
        "name": "Undine",
        "rarity": "UNCOMMON",
        "description": "> _These dynamic, fluid mortals trace their ancestry to creatures from the Plane of Water, such as faydhaans, water scamps, and brine dragons._\n\nUndines often go through life in a series of shifting phases, their interests waxing, waning, or sometimes morphing altogether as old loves are discarded for new interests. Structure provides a much-needed focus to undines’ lives, and without strong goals or support from those around them, undines can find themselves stagnating in feelings of despondence. Most undines feel they personify specific aspects of water, some seeing themselves with the strength and power of the waves, the speed and tenacity of a river current, or the calm of a peaceful lake or pond. Others identify with all these aspects and more, their demeanors shifting like the tides from one situation to the next.\n\nUndines born with a connection only to a specific subtype of elemental water, such as ice, brine, or mist, might have a specific undine lineage. These are typically passed down from parent to child, as with other geniekin, but on occasion, a child is born with a lineage never seen in their family. Sometimes lineages are the result of where an undine’s ancestors lived, such as rimesoul undines being born in the cold northern countries or at the tops of mountain peaks. At other times it can be related to the undine’s elemental heritage, as is often the case with brinesoul undines, who usually descend from brine dragons. Mistsoul undines might have a distant but powerful connection to elemental water, or might even have a bit of elemental air mixed into their ancestry.",
        "trait_id": 3038,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-undine-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 18,
        "version": "1.0",
        "heritage_id": 27420,
        "uuid": 1063580130780333,
        "deprecated": null
    },
    {
        "id": 70,
        "created_at": "2025-08-10T22:15:00.308184+00:00",
        "name": "Borai",
        "rarity": "COMMON",
        "description": "> Borais are a strange mix of living and undead, often born out of a tragic death or botched resurrection attempt. The etheric, headstrong, and necrotized lineages each represent different ways you could become a borai, either due to a failed attempt at coming back to life, your own unwillingness to die, or necromantic experimentation.\n\nA borai is simultaneously living and dead—a corpse reanimated by their own soul into something just barely alive. Despite being corporeal undead, a borai’s body is a living shell that protects their tattered, undead soul, making them something altogether unique.\n\nBorais are most often created by accident through a botched resurrection attempt (whether magical or technological) or necromantic experimentation. Some people transform after a near-death experience through sheer stubborn determination and refusal to accept death. Once a person becomes a borai, their living body and undead soul are inexorably bound to one another. A borai’s body draws vitality from the soul, preventing rot and degradation, while the soul tenaciously clings to their body, eerily preserving it in unchanging perfection. Even if a borai is killed and resurrected or reincarnated, this bond isn’t severed, and a borai always comes back as a borai.\n\nUnlike many forms of undead, borais are the same person they were before their death—they retain their personality, memories, and feelings, and often seek to maintain the emotional connections and relationships they forged in life. Yet death leaves its mark on borais, and many living beings innately sense something is off about them, straining a borai’s relationships and changing their social status. This slow souring of friendships and fracturing of support systems tends to push borais out of their comfort zone, driving them from their homes and past lives and toward the unknown—an experience that leaves many borais jaded, emotionally guarded, or overeager to embrace new experiences.\n\nIf you want to play a character who blurs the lines between living and dead, and who’s struggling to find their place in a strange afterlife, you should play a borai.",
        "trait_id": 4671,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-borai-detail.png",
        "content_source_id": 579,
        "version": "1.0",
        "heritage_id": 46003,
        "uuid": 8240418694380587,
        "deprecated": null
    },
    {
        "id": 4,
        "created_at": "2024-04-05T19:26:22.826562+00:00",
        "name": "Changeling",
        "rarity": "UNCOMMON",
        "description": "> _Changelings are the children of malevolent hags, born with occult magic and the potential to hear a psychic Call._\n\nTales of children stolen away and replaced by monsters exist across countless cultures—but the true monsters are the hags who bring these strange children into the world, either directly as their birth parents or indirectly when strange magic from their coven rituals affects babies in nearby villages. Such a child faces no end of challenges, often beginning life as an abandoned or orphaned outsider.\n\nThough a changeling generally resembles an ordinary member of their ancestry, their distinctive eyes—each a different color—set them apart. One of their eyes matches that of their father’s lineage, while the other matches the color of their hag mother’s, often in an unnatural shade such as violet or vivid green. Not everyone with differently colored eyes is a changeling, but this manifestation of changeling heritage makes it difficult for them to hide their nature and can lead to banishment. As they come of age, they manifest other characteristics from their mother, including supernatural abilities. Darkvision, clawlike fingernails, and innate magic are the most common.\n\nChangelings can be any gender, but women in particular are vulnerable to the Call, a psychic influence that urges them to abandon their mortal life, join the hag’s coven, and eventually become a hag themselves. Changelings who understand their heritage often fear the Call and work to resist its pull. Those who remain ignorant of their origin may find themselves subject to a terrible compulsion without knowing why.",
        "trait_id": 1434,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-changeling-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 1,
        "version": "1.0",
        "heritage_id": 20729,
        "uuid": 6162948440892683,
        "deprecated": null
    },
    {
        "id": 21,
        "created_at": "2024-05-20T01:31:44.534318+00:00",
        "name": "Suli",
        "rarity": "UNCOMMON",
        "description": "> _Sulis are geniekin who embody a mixture of elements, most commonly air, earth, fire, and water. They are typically the descendants of janns, genies of all four elements that wander the Universe instead of making a home on the Elemental Planes._\n\nAt birth, a suli resembles their mortal ancestry, not manifesting their otherworldly heritage until adolescence, when they awaken into their elemental power. Strong in body and will, sulis are dynamic and ever-changing, and most feel they embody either all the elements together at once or the traits of different elements at different times. Some see themselves as having multiple aspects or faces to their personalities—one for each element—that they cycle through over the course of days or weeks.",
        "trait_id": 3040,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-suli-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 18,
        "version": "1.0",
        "heritage_id": 27419,
        "uuid": 823807276881061,
        "deprecated": null
    },
    {
        "id": 66,
        "created_at": "2025-08-07T20:25:19.160438+00:00",
        "name": "Mixed Ancestry",
        "rarity": "UNCOMMON",
        "description": "You can choose a mixed ancestry to represent having two ancestral lines for your character. This doesn't preclude having more than two ancestries in your genealogy, but you'll need to work with your GM if you want to have more than two reflected in the rules. The possible combinations of ancestries are immeasurable, though most people in the Inner Sea region are familiar with only aiuvarins and dromaars, as those are the most common people of mixed ancestry they encounter.",
        "trait_id": 4646,
        "artwork_url": "",
        "content_source_id": 3,
        "version": "1.0",
        "heritage_id": 45770,
        "uuid": 5552621574563475,
        "deprecated": null
    },
    {
        "id": 71,
        "created_at": "2025-08-10T22:15:01.353209+00:00",
        "name": "Prismeni",
        "rarity": "COMMON",
        "description": "> Prismenis are mortals whose bodies or spirits have been influenced by the energies of the Drift. As beings attuned to the Drift, they feel a supernatural urge to travel and experience new things, experiment, and push their limits toward creative pursuits beyond the norm. The prismeni lineages each represent how they attuned to the Drift: Drift-touched were born in the Drift, spectrasoul have a connection to the enigmatic Drift-dwelling beings called spectra, and Triune’s chosen were the result of divine intervention.\n\nPrismenis are suffused with the energy of the Drift, a recently discovered hyperspace plane, and are spiritual kin to the spectra who call that plane home. Wherever they go and whatever they do, they always carry a fragment of the Drift inside them, and they can access that plane and its power through this internal connection.\n\nPrismenis are inherently “plugged in” to the Drift, but the origins of this connection vary. Most prismenis are born prismenis—some to parents who were particularly devout followers of Triune and some to non-worshippers who happened to be in the Drift when their child was born, hatched, gestated, or conceived. Yet, not all children born in the Drift become prismenis, just as not all those born to pious Triunites become prismenis. Most believe that their lineage is a direct result of Triune’s blessing, while others believe it comes down to luck, genetics, or a quantifiable scientific factor that’s yet to be identified.\n\nSome prismenis are not born but transformed, becoming prismenis only after prolonged close contact with a spectra or the Drift, connecting with a spectra gathering, or rewarded for performing a dangerous task on behalf of Triune. In these instances, becoming a prismeni is considered a blessing, granted by Triune to its chosen children. During the recent Drift Crisis, a year-long event that saw the Drift crash and slowly reboot back to functionality, more prismenis were born and transformed than ever before.\n\nLike the Drift itself, prismenis are always in motion and prone to change. They dislike idleness and monotony and sometimes go out of their way to break routines, traditions, and expectations simply for the pleasure of trying something new. This refusal to settle is often literal, with prismenis changing jobs and homes frequently or drifting in and out of relationships with abandon, but it’s just as often immaterial, with prismenis embracing innovation, experimentation, education, and new fads and trends. Prismenis like to travel and explore, usually to places and planets far away, and feel a thrill at experiencing the unfamiliar. Many can instinctively control and understand technology or speak wirelessly with technological creatures. Some can create and harness electricity. To many prismenis, entering the Drift feels like coming home, and most describe it as tranquil or soothing. Some prismenis have a connection to the Drift so strong that their body is sustained or rejuvenated by its energies—the Drift nourishes their bodies, heals their wounds, protects them from harm, and settles their ever-racing thoughts.\n\nIf you want to play a character who embraces change and exploration, or who has a connection to the Drift, you should play a prismeni.",
        "trait_id": 4672,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-prismeni-detail.png",
        "content_source_id": 579,
        "version": "1.0",
        "heritage_id": 46004,
        "uuid": 5632594515713625,
        "deprecated": null
    },
    {
        "id": 23,
        "created_at": "2024-05-20T18:03:50.068171+00:00",
        "name": "Beastkin",
        "rarity": "RARE",
        "description": "> _Beastkin have extraordinary abilities derived from the animal world, allowing them to partially or fully transform into animals, granting them deadly fangs, refined senses, and other such traits. A beastkin treads the line between nature and society, living with a foot in each._\n\nBeastkin is a blanket term for any person who has gained the ability to partially or fully transform into an animal through any number of means, while maintaining a balance with their humanoid side. Most beastkin are born of werecreatures or have a werecreature ancestor in their lineage. The curse might not always fully manifest in the child of the werecreature pairing, giving the child the transformative nature of their lineage without a weakness to silver or a loss of control during the full moon. Born or made, werecreatures usually hold such beastkin in high regard, as they embody many of their strengths without any of their weaknesses.\n\nAside from werecreatures, there are various other paths to becoming a beastkin. In some cases, a deity or a nature spirit may grant a chosen individual the power to transform. Others have gained the powers of beastkin through a trick of the fey or an unusual reaction to polymorph magic. There are even rumors that some rare beastkin might be shapeshifting animals that somehow gained the form of a sapient ancestry, rather than the other way around.\n\nIf you want a character that treads the boundaries between rationality and instinct, at home in both society and the wilds yet set apart from both, you should play a beastkin.",
        "trait_id": 3037,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-beastkin-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 18,
        "version": "1.0",
        "heritage_id": 27474,
        "uuid": 3029689205992607,
        "deprecated": null
    },
    {
        "id": 20,
        "created_at": "2024-05-20T01:23:30.426436+00:00",
        "name": "Reflection",
        "rarity": "RARE",
        "description": "> _Stories of malevolent duplicates are commonly told around campfires to frighten companions. In these tales, the duplicate forms after a botched ritual or exposure to a mysterious artifact, and is bent on replacing the creature they’ve replicated. Most believe such stories to be only that, but such reflection duplicates are real. While some wish to replace their progenitors, others merely want to forge a new life for themselves where no one knows of their origins._\n\nMethods of their creation vary, but all reflections are duplicates of someone else existing in the world. Some are drawn out from literal mirrors, developing a life of their own once set free from the Echoing Pale. Mirror-focused rituals or spells can create independent reflections, whether deliberately or accidentally, as can the magical hazard known as a Darkside Mirror, which replaces those looking into it with malicious duplicates. Some reflections are created as magical clones by spellcasters, only to turn on their creators or be left adrift, while others arise from polymorph magic gone wrong.\n\nIf you want a character who seeks to forge their own identity in the face of their duplicate nature, with a strong tie to another character somewhere out there in the world, you should play a reflection.",
        "trait_id": 3407,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-reflection-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 12,
        "version": "1.0",
        "heritage_id": 22869,
        "uuid": 6724812260165672,
        "deprecated": null
    },
    {
        "id": 35,
        "created_at": "2024-07-24T19:04:17.959473+00:00",
        "name": "Dhampir",
        "rarity": "UNCOMMON",
        "description": "> _The mortal offspring of undead vampires are caught between life and undeath, mortality and immortality, mundane existence and powerful magic. Dhampirs enjoy long life spans and otherworldly charm, but their ghostly pallor and the nature of their parentage make their lives in humanoid societies difficult._\n\nMany call vampires the children of the night, but it’s dhampirs who can truly claim that title. These mortal offspring of vampires walk the line between life and undeath not just physiologically, but also in their social standing, temperament, and worldview. The circumstances surrounding a dhampir’s birth are rare, complex, and often shrouded in horrific rumors. Some dhampirs are the child of one mortal and one vampiric parent, while others are born to those who were turned into vampires while pregnant. Still others rise from occult rituals or other supernatural influences that impose a vampiric curse onto a mortal infant. The life of a dhampir is often difficult; few vampiric parents have the inclination to raise a mortal child, while mortal communities find a dhampir’s sallow flesh, piercing eyes, and unnerving presence off-putting at best.\n\nDespite being living creatures, dhampirs respond to vitality and void energy as if they were undead, making them unwelcome in many holy communities and often driving them toward necromantic arts. Dhampirs aren’t immortal, but age far more slowly than most mortals, with a lifespan similar to that of an elf. Dhampirs have difficulty producing children of their own, and those few born to a dhampir are never dhampirs themselves.\n\nA dhampir generally resembles a member of their non-vampire parent’s ancestry, but with a ghostly pallor and eyes so light it seems they have only pinpoint pupils and no iris. All dhampirs have elongated incisors, some nearly as long as those of a true vampire. Many command grace, beauty, and charm despite their unsettling appearance.",
        "trait_id": 3618,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-dhampir-rm-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 256,
        "version": "1.0",
        "heritage_id": 30834,
        "uuid": 967287167673522,
        "deprecated": null
    },
    {
        "id": 22,
        "created_at": "2024-05-20T13:22:26.040004+00:00",
        "name": "Naari",
        "rarity": "UNCOMMON",
        "description": "> _Naaris descend from creatures such as ifrits, salamanders, and magma dragons. Their spark of ancestral flame gives them a reputation for being passionate, if not capricious._\n\nNaaris often build up personal relationships between themselves and the idea of fire, feeling as though they embody it mentally or spiritually, in addition to physically. Some naaris relate to fire’s mutable energy, illuminating properties, or destructive nature.\n\nSome naaris share a connection from birth to specific aspects of elemental fire, such as radiance, ash, or lava; this is called a naari lineage. Naaris often have the same lineage as their parents, though sometimes naaris are born with lineages different from their families, or to parents without one. Lineages can appear in naari children as a reflection of where they were born—for example, cindersoul naaris sometimes originate from being born in areas prone to forest fires. They can also occur as a reflection of the naari’s planar ancestry, such as a brightsoul naari having a fire-themed celestial ancestor like a peri. Magma naaris with the lavasoul lineage are most often born the descendants of magma dragons or other lava-themed fire elementals.",
        "trait_id": 2999,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-ifrit-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 18,
        "version": "1.0",
        "heritage_id": 23268,
        "uuid": 2361607178254194,
        "deprecated": null
    },
    {
        "id": 16,
        "created_at": "2024-05-19T18:18:04.315668+00:00",
        "name": "Dhampir (legacy)",
        "rarity": "UNCOMMON",
        "description": "> _Many call vampires the children of the night, but it is dhampirs who can truly claim that title. These mortal offspring of vampires walk the line between life and undeath not just physiologically, but also in their social standing, temperament, and worldview._\n\nThe circumstances surrounding a dhampir's birth are rare, complex, and often shrouded in horrific rumors stoked by societal revulsion at the idea of an undead monstrosity producing mortal offspring. Some dhampirs are the child of one mortal and one vampiric parent, while others are born to those who were turned into vampires while pregnant. Still others rise from dark rituals or other supernatural influences that impose a vampiric curse onto a mortal infant. The life of a dhampir is often difficult: few vampiric parents have the time or inclination to raise a mortal child, while mortal communities find a dhampir's sallow flesh, piercing eyes, and unnerving presence off-putting at best.\n\nDespite being living creatures, dhampirs respond to vitality and void energy as if they were undead, making them unwelcome in many holy communities and often driving them toward necromantic arts. Dhampirs aren't immortal, but age far more slowly than most mortals, with a lifespan similar to that of an elf. Dhampirs have difficulty producing children of their own, and those few born to a dhampir are never dhampirs themselves.\n\nA dhampir generally resembles a member of their non-vampire parent's ancestry, but with a ghostly pallor and eyes so light it seems they have only pinpoint pupils and no iris. All dhampirs have elongated incisors, some nearly as long as those of a true vampire. Many command grace, beauty, and charm, despite their unsettling appearance.",
        "trait_id": 3406,
        "artwork_url": "https://2e.aonprd.com/Images/Ancestries/Dhampir02.png",
        "content_source_id": 14,
        "version": "1.0",
        "heritage_id": 27416,
        "uuid": 5952417238146822,
        "deprecated": null
    },
    {
        "id": 6,
        "created_at": "2024-04-20T21:31:22.486321+00:00",
        "name": "Duskwalker (legacy)",
        "rarity": "COMMON",
        "description": "> _The first duskwalkers manifested as the result of a bargain between two powerful psychopomps, the immortal guardians and guides of souls after death. One believed that certain souls who helped preserve the cycle of life and death but had their own lives cut short deserved reincarnation, while the other felt this would too greatly violate that same cycle. In the end, the duskwalkers rose from a concession between the two that allowed such rebirths to occur but limited their frequency—only a finite number of duskwalkers ever exist at any one point in time._\n\nWhen they were first created by psychopomps, duskwalkers were expected to perform roles that would serve the goddess of death, Pharasma, and by extension her realm, the Boneyard. But now duskwalkers have found themselves with more freedom of choice and after a century, have only now come to terms with the fact that their destinies are their own to choose. As they are created, not born, most duskwalkers either struggle to integrate with society or seek out communities and organizations to serve as a surrogate family.\n\nDuskwalkers have an inherent understanding of the cycle of life and death. In most cases this manifests as a deep respect for that cycle and pushes the duskwalker toward occupations that help them to protect it, such as hunters of the undead, midwives, morticians, and priests.\n\nIf you want a character who has a mysterious background, seeks a society or organization to join, or looks to fight against undead, you should play a duskwalker.",
        "trait_id": 2957,
        "artwork_url": "https://2e.aonprd.com/Images/Ancestries/Duskwalker02.png",
        "content_source_id": 14,
        "version": "1.0",
        "heritage_id": 22889,
        "uuid": 2205494199431041,
        "deprecated": null
    },
    {
        "id": 36,
        "created_at": "2024-07-24T19:11:04.783568+00:00",
        "name": "Dragonblood",
        "rarity": "UNCOMMON",
        "description": "> _While there are many ways a mortal can be imbued with draconic powers, dragonbloods have an inherent natural affinity. Children born of draconic lineage or blessed by a dragon deity find themselves skirting the line of mortal and dragon, often taking on draconic appearances and boasting strong personalities._\n\nDragons are powerful creatures, and many have involved themselves deeply in the lives of others. Some might be treated with reverence by a group of smaller humanoids, acting as their protector or, in rare cases, deity incarnate. Others take on a humanoid form to live within a civilization as their neighbors’ equal, sometimes hiding their true identity to observe or manipulate. Whatever the dragon’s intent or actions during these times, they leave an indelible impression on the people they encounter, whether or not those people realize it. A child may be born as the result of such an influence, and these offspring are known as dragonbloods.\n\nA dragonblood may be born from any ancestry and found in just about any region of Golarion, as dragons tend to go where they please. Some dragonbloods possess obvious draconic traits, from clawed hands to leathery wings to a mighty reptilian tail; these features always resemble similar aspects of the dragonblood’s draconic forebear. For instance, the scion of an adamantine dragon might have thick, plate-like scales on their chest. Other dragonbloods more closely resemble dragons than the other half of their heritage, leading many to mistake them for kobolds, iruxis, or other reptilian ancestries; such dragonbloods who are proud of their draconic lineage are quick to point out this mistake. There are also those dragonbloods whose outward appearances suggest only a hint of dragon blood. They might have a barely noticeable sheen to their skin or the small nubs of horns, but they often have an outsized force of personality or innate magical abilities.\n\nAreas in which dragons have more influence or cultural significance see a higher population of dragonbloods than other places. The countries of Tian Xia are often referred to as the Dragon Empires due to the fact that many dragons take active roles in local humanoid societies. A leader in the Lands of the Linnorm Kings who takes on a curse from killing a linnorm might find that the eyes of their next offspring glow with an eldritch light. Communities that pay homage to the dragon gods Apsu or Dahak can also be blessed with dragonblood births.",
        "trait_id": 3619,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-dragonblood-rm-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 256,
        "version": "1.0",
        "heritage_id": 30837,
        "uuid": 5923395802747142,
        "deprecated": null
    },
    {
        "id": 37,
        "created_at": "2024-07-24T19:14:09.356977+00:00",
        "name": "Duskwalker",
        "rarity": "UNCOMMON",
        "description": "> _A duskwalker isn’t born; they are instead created, each manifesting as a mortal child in a location with close ties to death. They embody the somber powers of the psychopomps, immortal guardians and shepherds of the dead, and they maintain a fascination with and deep understanding of death throughout their lives. More singular than other versatile heritages, duskwalkers don’t have different lineages._\n\nThe first duskwalkers manifested as the result of a bargain between two powerful psychopomps, the immortal guardians and guides of souls after death. One believed that souls who helped preserve the cycle of life and death—but had their own lives cut short—deserved reincarnation, while the other felt this would too greatly violate that same cycle. In the end, duskwalkers rose from a concession between the two psychopomps: such rebirths could occur, but in limited frequency. Only a finite number of duskwalkers ever exist at any one point in time.\n\nWhen a duskwalker perishes and faces final judgment, a new one incarnates within a year from a deserving soul, typically somewhere far from the previous duskwalker’s birthplace. Duskwalkers manifest in locations with a sanctified connection to death, such as graveyards or temples, and begin their lives at adolescence. No duskwalker is capable of bearing or siring biological children, but this doesn’t prevent them from establishing families, typically through adoption.\n\nDuskwalkers have an inherent understanding of the cycle of life and death. In most cases this manifests as a deep respect for that cycle and pushes the duskwalker toward occupations that help them to protect it, such as hunters of the undead, midwives, morticians, and priests.",
        "trait_id": 3620,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-duskwalker-rm-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 256,
        "version": "1.0",
        "heritage_id": 30838,
        "uuid": 5768033141619813,
        "deprecated": null
    },
    {
        "id": 2,
        "created_at": "2024-04-05T19:25:18.29699+00:00",
        "name": "Aiuvarin",
        "rarity": "COMMON",
        "description": "> _Elves’ children with people of other ancestries, and the children of their children, are called “aiuvarin”, an elven word that refers to a poem about leaves that fall too quickly to the ground. The most familiar aiuvarins in Golarion are born to an elf and a human, or to two aiuvarins. Those born of these unions are commonly referred to as “half-elves.” The life of an aiuvarin can be difficult, often marked by a struggle to fit in. Aiuvarins don’t have their own homeland on Golarion, nor are populations of aiuvarins particularly tied to one another since they often have very disparate traditions from their parents’ ancestries. Instead, they often attempt to find acceptance in their parents’ cultures or settlements._\n\nAiuvarins often have pointed ears and can be lanky, along with manifesting traits from their non-elven ancestors. They lack the almost-alien eyes of their elf parents, and their work to find a place for themselves in communities where they’re often out of sync with the dominant culture leads many to become artists or entertainers. Despite this innate socialization, many aiuvarins have difficulty forming lasting bonds with either of their parents’ people due to the distance they feel from both communities as a whole.\n\nAiuvarins gain some, but not all, of their elven parent’s longevity, and those with a human parent often live for around 150 years. This causes some of them to fear friendship and romance with humans, knowing that they’ll likely outlive their companions.",
        "trait_id": 1489,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-aiuvarin-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 1,
        "version": "1.0",
        "heritage_id": 20720,
        "uuid": 587288145508360,
        "deprecated": null
    },
    {
        "id": 1,
        "created_at": "2024-04-05T19:24:28.617359+00:00",
        "name": "Dromaar",
        "rarity": "COMMON",
        "description": "> _As the orcs of Belkzen have become a critical vanguard in the war against the Whispering Tyrant, sometimes fighting alongside allies of other ancestries, children with a mix of orc heritage and that of another ancestry (typically human) have grown in number. Many of these “half-orcs” refer to themselves as “dromaars,” an orcish word referring to those drummers whose music sends the hordes marching to war, seeing themselves as heralds of a new age for orcs in the Inner Sea region. Some intolerant humanoids see orcs as more akin to monsters than people, hating and fearing them simply due to their lineage. This can push dromaars to the margins of society, where some find work in manual labor, as mercenaries, or in crime. Many who can’t stand the indignities heaped on them in human society find a home among their orc kin or trek into the wilderness._\n\nSome humans assume dromaars are less intelligent or uncivilized, and dromaars rarely find acceptance among societies with many such folk. To an orc hold, a dromaar is often considered a valuable addition, making up for anything they might lack in physical strength with gifts inherited from their other ancestral line. While some dromaars struggle to claim a name for themselves in the unforgiving hierarchies of orc holds, others may find that orcish society is far more tolerant and can create opportunities to rise high.\n\nA dromaar with a human parent can typically live to around 70 years old.",
        "trait_id": 1512,
        "artwork_url": "https://2e.aonprd.com/Images/Monsters/Dromaar_Mountaineer.webp",
        "content_source_id": 1,
        "version": "1.0",
        "heritage_id": 20733,
        "uuid": 7942712727600802,
        "deprecated": null
    },
    {
        "id": 3,
        "created_at": "2024-04-05T19:25:54.298539+00:00",
        "name": "Nephilim",
        "rarity": "UNCOMMON",
        "description": "> _Countless legends tell of mortal dealings with immortal beings, and of the children born from those encounters. These children, known as planar scions, are mortals who inherit the supernatural essence of another plane, which manifests through their distinctive physical features and otherworldly powers. This section presents rules for nephilim, planar scions who can trace their extraplanar heritage back to celestials, fiends, monitors, and other entities who often become involved in the religious affairs of mortals._\n\nA faithful priest of Erastil is visited by an angel in his youth, and many years later he fathers a child with the head of an elk and a birthmark shaped like Erastil’s religious symbol, a bow and arrow. A powerful sorceress prevents an incursion from the Outer Rifts, but a sliver of demonic power infuses the child she carries, who is born with fangs and a pair of tiny horns. A planar caravan travels the Multiverse until its ranks are filled with children who possess devilish hooves and angelic halos. These children, known as nephilim, possess the ambition and capacity for growth and change inherent in their mortal forebears, while also possessing some portion of the power and appearance of an immortal entity or entities whose energies influenced their bloodline.\n\nNephilim are difficult to categorize by nature. Some possess both demonic and angelic traits, while others possess abilities that defy the neat categories of scholars. Many nephilim do have traits that strongly point to their lineage, though. Nephilim who carry the power of archons, sometimes known as lawbringers, may display golden eyes or flaming auras, while nephilim descended from devils, known as hellspawn, may have red skin and hooved feet. While the term nephilim broadly describes these individuals, some cultures use the name empyrean or cambion to refer to nephilim with celestial influence or fiendish influence respectively. Other nephilim sometimes earn the names of aphorite or ganzi, though this entry only focuses on empyreans and cambions.\n\nIf you want a character who is supernaturally infused with the power of the Outer Planes, whose appearance is striking and notable, and whose personal connections might extend beyond the bounds of the Universe, you should play a nephilim.",
        "trait_id": 1451,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-nephilim-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 1,
        "version": "1.0",
        "heritage_id": 20745,
        "uuid": 1533125043539144,
        "deprecated": null
    },
    {
        "id": 45,
        "created_at": "2024-09-03T03:07:25.479172+00:00",
        "name": "Borai (Playtest)",
        "rarity": "COMMON",
        "description": "> _A borai is simultaneously living and dead—a corpse reanimated by its own soul into something just barely living. Despite being corporeal undead, a borai’s body is alive, and functions as a living shell that protects their tattered, undead soul, making them something altogether unique._\n\nBorais are most often created by others through a botched resurrection attempt (whether magical or technological) or necromantic experimentation, or by oneself through sheer stubborn determination and refusal to accept one’s demise. Once a person becomes a borai, their living body and undead soul are inexorably bound to one another. A borai’s body draws vitality from the soul, preventing external rot and degradation, while the soul tenaciously clings to their body as a vehicle for corporeality and prolonged life. Even if a borai is killed and resurrected or reincarnated, this bond isn’t severed, and a borai always comes back as a borai.\n\nUnlike many forms of undead, borais are the same person they were before their death—they retain their personality, memories, and feelings, and often seek to maintain the emotional connections and relationships they forged in life. Yet, death has left its mark on borais, and many living beings innately sense something is off about a borai, putting a strain on a borai’s relationships and other pre-existing social connections. This slow fracturing of friendships and souring of support systems tends to push borais out of their comfort zone, driving them from their homes and past lives and toward the unknown—an experience that leaves many borais jaded, emotionally guarded, or eager to embrace new experiences.\n\nIf you want to play a character who blurs the lines between living and dead, and who’s struggling to find their place in the universe, you should play a borai.",
        "trait_id": 3714,
        "artwork_url": "https://images.demiplane.com/elements/starfinder2e/heritages/ancestry-borai-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 276,
        "version": "1.0",
        "heritage_id": 34632,
        "uuid": 3965216235978999,
        "deprecated": null
    },
    {
        "id": 46,
        "created_at": "2024-09-03T03:24:29.421975+00:00",
        "name": "Prismeni (Playtest)",
        "rarity": "COMMON",
        "description": "> _Prismenis are suffused with the energy of the Drift, a recently discovered hyperspace plane, and are spiritual kin to the spectra who call that plane home. Wherever they go and whatever they do, they carry a fragment of the Drift inside them, and they can access that plane and its power through this internal connection._\n\nPrismenis are inherently “plugged in” to the Drift, but the origins of this connection are variable. Most prismenis were born prismenis—some to parents who were particularly devout followers of Triune and some to nonworshippers who happened to be in the Drift when their child was born, hatched, gestating, or conceived. Yet, not all children born in the Drift become prismenis, just as not all those born to pious Triunites become prismenis. Most believe that their lineage is a direct result of Triune’s blessing, while others believe it comes down to luck, genetics, or a quantifiable scientific factor that’s yet to be identified.\n\nSome prismenis aren’t born but transformed, becoming prismenis only after prolonged close contact with a spectra, being present at a spectra gathering, or after performing a dangerous task on behalf of Triune. In these instances, becoming a prismeni is considered a blessing, granted by Triune to its chosen children. During the recent Drift Crisis, a year-long event that saw the Drift crash and slowly reboot back to functionality, prismenis were born and transformed with incredible frequency, increasing their population and incidentally giving prismenis greater influence on the galactic stage than ever before.\n\nLike the Drift itself, prismenis are always in motion. They dislike idleness and monotony and sometimes go out of their way to break routines, traditions, and expectations simply for the excitement of trying something new. This refusal to settle is often literal, with prismenis changing jobs and homes frequently, or drifting in and out of relationships with abandon, but it’s just as often immaterial, with prismenis embracing innovation, experimentation, education, or new fads and trends. Prismenis like to travel and explore, usually to places and planets far from their own, and feel a thrill at experiencing the unfamiliar. Many can instinctively control and understand technology or speak wirelessly with technological creatures. Some can create and harness electricity. To many prismenis, entering the Drift feels like coming home, and most describe it as tranquil or soothing. Some prismenis have a connection to the Drift so strong that their body is sustained or rejuvenated by its energies—the Drift nourishes their bodies, heals their wounds, protects them from harm, and settles their ever-racing thoughts.\n\nIf you want to play a character who embraces change and exploration, or who has a connection to the Drift, you should play a prismeni.",
        "trait_id": 3715,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/ancestry-prismeni-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 276,
        "version": "1.0",
        "heritage_id": 34633,
        "uuid": 2043606093588139,
        "deprecated": null
    },
    {
        "id": 47,
        "created_at": "2024-09-05T18:05:52.003257+00:00",
        "name": "Hungerseed",
        "rarity": "UNCOMMON",
        "description": "> _Oni in Tian Xia are commonly seen as evil creatures satisfied only by blood and carnage. Not all of them have such violent hungers, however, and even the worst aren’t so far removed from the most gluttonous or ambitious mortals. Stories of humans taking an oni bride are often told in rural villages and, occasionally, a child is born with telltale oni horns or a third eye. Commonly called half-oni or onispawn, these hungerseeds—named after oni’s legendary appetites—are often difficult youths, as their adolescent tempers often outweigh their common sense._\n\nHungerseeds appear incredibly diverse physically. Many features, such as their skin, horns, feet, and hair, are often influenced by their oni parent and, while many share the hulking stature of an oni, others have lithe and slender builds or are even notably shorter than both parents. They walk a fine line between mortal and supernatural, one clawed foot in each world.\n\nAs a nation controlled by oni, Chu Ye has the highest population of hungerseeds in Tian Xia. While hungerseeds can occupy almost every profession, they often choose combat roles to complement their oni heritage. Many of them feel safer in Chu Ye than in other regions, as they don’t have to deal with the misconceptions of their lineage. However, some feel out of place for not fully being oni, and become wanderers. Others form mercenary bands, to find work and a shared camaraderie in their mixed heritage.\n\nCharacters of Tian origin have access to the hungerseed versatile heritage.",
        "trait_id": 3937,
        "artwork_url": "https://images.demiplane.com/elements/pathfinder-2e/heritages/heritage-hungerseed-detail.png?format=webp&quality=90&width=1920",
        "content_source_id": 318,
        "version": "1.0",
        "heritage_id": 34796,
        "uuid": 3174093456346673,
        "deprecated": null
    }
]
